#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.instance_service_account.google_service_account.service_accounts["custom-instance-sa"]: Refreshing state... [id=projects/scalesec-dev/serviceAccounts/custom-instance-sa@scalesec-dev.iam.gserviceaccount.com]
module.service_accounts.google_service_account.service_accounts["chef-inspec-sa"]: Refreshing state... [id=projects/tdd-testing-environment/serviceAccounts/chef-inspec-sa@tdd-testing-environment.iam.gserviceaccount.com]
module.instance_service_account.data.template_file.keys["custom-instance-sa"]: Refreshing state... [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.instance_service_account.google_project_iam_member.project-roles["custom-instance-sa-scalesec-dev=>roles/secretmanager.secretAccessor"]: Refreshing state... [id=scalesec-dev/roles/secretmanager.secretAccessor/serviceaccount:custom-instance-sa@scalesec-dev.iam.gserviceaccount.com]
module.service_accounts.data.template_file.keys["chef-inspec-sa"]: Refreshing state... [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
google_compute_instance.scalesec: Refreshing state... [id=projects/tdd-testing-environment/zones/us-west1-a/instances/scalesec-test]
module.service_accounts.google_project_iam_member.project-roles["chef-inspec-sa-tdd-testing-environment=>roles/viewer"]: Refreshing state... [id=tdd-testing-environment/roles/viewer/serviceaccount:chef-inspec-sa@tdd-testing-environment.iam.gserviceaccount.com]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.scalesec must be replaced
-/+ resource "google_compute_instance" "scalesec" {
        allow_stopping_for_update = true
        can_ip_forward            = false
      ~ cpu_platform              = "Unknown CPU Platform" -> (known after apply)
      ~ current_status            = "TERMINATED" -> (known after apply)
        deletion_protection       = false
      - enable_display            = false -> null
      ~ guest_accelerator         = [] -> (known after apply)
      ~ id                        = "projects/tdd-testing-environment/zones/us-west1-a/instances/scalesec-test" -> (known after apply)
      ~ instance_id               = "7504826701870697983" -> (known after apply)
      ~ label_fingerprint         = "3MaM1ANwuOs=" -> (known after apply)
        labels                    = {
            "data_classification" = "public"
            "environment"         = "test"
        }
        machine_type              = "n1-standard-1"
      - metadata                  = {} -> null
      ~ metadata_fingerprint      = "T9Xl7bgIp_E=" -> (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "scalesec-test"
      ~ project                   = "tdd-testing-environment" -> "scalesec-dev" # forces replacement
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/tdd-testing-environment/zones/us-west1-a/instances/scalesec-test" -> (known after apply)
      - tags                      = [] -> null
      ~ tags_fingerprint          = "42WmSpB8rSM=" -> (known after apply)
        zone                      = "us-west1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/tdd-testing-environment/zones/us-west1-a/disks/scalesec-test" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910" -> "debian-cloud/debian-9"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/tdd-testing-environment/global/networks/default" -> "default"
          ~ network_ip         = "10.138.0.2" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/tdd-testing-environment/regions/us-west1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "tdd-testing-environment" -> (known after apply)

          ~ access_config {
              + nat_ip       = (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      ~ service_account {
          ~ email  = "custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com" -> "custom-instance-sa@scalesec-dev.iam.gserviceaccount.com"
            scopes = [
                "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @eric-gonzales, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*